{
  "char_to_id": {
    "<pad>": 0,
    "<unk>": 1,
    "<s>": 2,
    "</s>": 3,
    "<mask>": 4,
    " ": 5,
    "!": 6,
    "\"": 7,
    "#": 8,
    "$": 9,
    "%": 10,
    "&": 11,
    "'": 12,
    "(": 13,
    ")": 14,
    "*": 15,
    "+": 16,
    ",": 17,
    "-": 18,
    ".": 19,
    "/": 20,
    "0": 21,
    "1": 22,
    "2": 23,
    "3": 24,
    "4": 25,
    "5": 26,
    "6": 27,
    "7": 28,
    "8": 29,
    "9": 30,
    ":": 31,
    ";": 32,
    "<": 33,
    "=": 34,
    ">": 35,
    "?": 36,
    "@": 37,
    "A": 38,
    "B": 39,
    "C": 40,
    "D": 41,
    "E": 42,
    "F": 43,
    "G": 44,
    "H": 45,
    "I": 46,
    "J": 47,
    "K": 48,
    "L": 49,
    "M": 50,
    "N": 51,
    "O": 52,
    "P": 53,
    "Q": 54,
    "R": 55,
    "S": 56,
    "T": 57,
    "U": 58,
    "V": 59,
    "W": 60,
    "X": 61,
    "Y": 62,
    "Z": 63,
    "[": 64,
    "\\": 65,
    "]": 66,
    "^": 67,
    "_": 68,
    "`": 69,
    "a": 70,
    "b": 71,
    "c": 72,
    "d": 73,
    "e": 74,
    "f": 75,
    "g": 76,
    "h": 77,
    "i": 78,
    "j": 79,
    "k": 80,
    "l": 81,
    "m": 82,
    "n": 83,
    "o": 84,
    "p": 85,
    "q": 86,
    "r": 87,
    "s": 88,
    "t": 89,
    "u": 90,
    "v": 91,
    "w": 92,
    "x": 93,
    "y": 94,
    "z": 95,
    "{": 96,
    "|": 97,
    "}": 98,
    "~": 99,
    "\n": 100,
    "\t": 101,
    "\r": 102,
    "©": 103,
    "®": 104,
    "™": 105,
    "€": 106,
    "£": 107,
    "¥": 108,
    "°": 109,
    "±": 110,
    "×": 111,
    "÷": 112,
    "à": 113,
    "á": 114,
    "â": 115,
    "ã": 116,
    "ä": 117,
    "å": 118,
    "è": 119,
    "é": 120,
    "ê": 121,
    "ë": 122,
    "ì": 123,
    "í": 124,
    "î": 125,
    "ï": 126,
    "ò": 127,
    "ó": 128,
    "ô": 129,
    "õ": 130,
    "ö": 131,
    "ù": 132,
    "ú": 133,
    "û": 134,
    "ü": 135,
    "ñ": 136,
    "ç": 137,
    "ß": 138,
    "…": 139,
    "—": 140,
    "–": 141,
    ", ": 142
  },
  "word_to_id": {
    "# enigma engine dictionary": 143,
    "# add words here (one per line) to expand the ai's vocabulary": 144,
    "# these words get their own token ids for more efficient processing": 145,
    "# === common conversational words ===": 146,
    "hello": 147,
    "goodbye": 148,
    "thanks": 149,
    "please": 150,
    "sorry": 151,
    "welcome": 152,
    "great": 153,
    "awesome": 154,
    "wonderful": 155,
    "terrible": 156,
    "amazing": 157,
    "# === technical terms ===": 158,
    "algorithm": 159,
    "database": 160,
    "framework": 161,
    "repository": 162,
    "variable": 163,
    "function": 164,
    "parameter": 165,
    "interface": 166,
    "module": 167,
    "library": 168,
    "dependency": 169,
    "configuration": 170,
    "initialization": 171,
    "optimization": 172,
    "implementation": 173,
    "# === ai/ml terms ===": 174,
    "transformer": 175,
    "attention": 176,
    "embedding": 177,
    "gradient": 178,
    "backpropagation": 179,
    "epoch": 180,
    "batch": 181,
    "tensor": 182,
    "vector": 183,
    "matrix": 184,
    "neuron": 185,
    "layer": 186,
    "activation": 187,
    "softmax": 188,
    "sigmoid": 189,
    "relu": 190,
    "dropout": 191,
    "regularization": 192,
    "overfitting": 193,
    "underfitting": 194,
    "hyperparameter": 195,
    "# === your custom words ===": 196,
    "# add domain-specific words below": 197,
    "# example: if your ai is for cooking, add cooking terms": 198,
    "# example: if your ai is for gaming, add gaming terms": 199,
    "enigma": 200,
    "assistant": 201,
    "robot": 202,
    "avatar": 203
  },
  "next_id": 204
}